app/controllers/api/v1/apartment_controller.rb

            def index
                apartment = Apartment.order('created_at DESC');
---
SELECT `apartments`.* FROM `apartments` ORDER BY created_at DESC

            def show
                apartment = Apartment.find(params[:id])
---
SELECT `apartments`.* FROM `apartments` WHERE `apartments`.`id` = 1 LIMIT 1

            def create
                apartment = Apartment.new(apartment_params)

                if apartment.save
---
INSERT INTO `apartments` (`name`, `description`, `price`, `location`, `created_at`, `updated_at`) VALUES ('test 111', 'jhkjhkjhkjh', '2222', 'jhkjhkjhkjh', '2022-01-10 00:17:29.381547', '2022-01-10 00:17:29.381547')

            def destroy
                apartment = Apartment.find(params[:id])
                apartment.destroy
---
SELECT `apartments`.* FROM `apartments` WHERE `apartments`.`id` = 5 LIMIT 1
DELETE FROM `apartments` WHERE `apartments`.`id` = 5

            def update
                apartment = Apartment.find(params[:id])
                if apartment.update(apartment_params)
---
SELECT `apartments`.* FROM `apartments` WHERE `apartments`.`id` = 2 LIMIT 1
UPDATE `apartments` SET `apartments`.`name` = 'kalinga', `apartments`.`description` = 'asd', `apartments`.`price` = '222ww', `apartments`.`location` = 'asdaaa', `apartments`.`updated_at` = '2022-01-10 00:23:55.931405' WHERE `apartments`.`id` = 2