app/controllers/api/v1/booking_controller.rb

SELECT `bookings`.* FROM `bookings` ORDER BY created_at DESC
---
            def index
                booking = Booking.order('created_at DESC');

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1
---
            def show
                booking = Booking.find(params[:id])

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`bookingdate` = '222' ORDER BY `bookings`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `bookings` WHERE `bookings`.`booking_date` = '2' AND `bookings`.`appartment_id` = '1' LIMIT 1
INSERT INTO `bookings` (`booking_date`, `booking_time`, `appartment_id`, `client_name`, `client_email`, `isbook`, `created_at`, `updated_at`) VALUES ('2', 'jhkjhkjhkjh', '1', 'jhkjhkjhkjh', 'sdsadasd44', '1', '2022-01-11 04:00:23.876698', '2022-01-11 04:00:23.876698')
---
            def create
                booking = Booking.new(booking_params)
                id = booking_params[:booking_date]
                aprtid = booking_params[:appartment_id]
                msg = 'Unable To booking !selected date alredy Booked!!!... Time Try Anther Day'
                if Booking.exists?(:booking_date => id,:appartment_id => aprtid)

                          render json: {status: 'ERROR', message: msg }, status: :unprocessable_entity

                else
                    if booking.save